In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('uber_rides_data.csv')

df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,25894730,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,17610152,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5

## How many integer columns(by default) are given in the dataset?

## What is the data type of ' pickup_datetime' feature in your data?

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   ride_id            200000 non-null  int64
 1   fare_amount        200000 non-null  float64
 2   pickup_datetime    200000 non-null  object
 3   pickup_longitude   200000 non-null  float64
 4   pickup_latitude    200000 non-null  float64
 5   dropoff_longitude  199999 non-null  float64
 6   dropoff_latitude   199999 non-null  float64
 7   passenger_count    200000 non-null  int64
dtypes: float64(5), int64(2), object(1)
memory usage: 12.2+ MB

## What is the shape of given dataset?

In [4]:
df.shape

(200000, 8)

## How many missing values exists in 'dropoff_longitude' column?

In [5]:
df['dropoff_longitude'].isnull().sum()

1

In [6]:
df.isnull().sum()

ride_id              0
fare_amount          0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    1
dropoff_latitude     1
passenger_count      0
dtype: int64

## Which function can be used to remove null values from the dataframe?

In [7]:
df = df.dropna(how='any',axis=0)

## What is the average fare amount? Remove the null values from the dataframe to answer the following question.

In [ ]:
11.359892

In [8]:
df.describe()

,ride_id,fare_amount,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
count,1.999990e+05,199999.000000,199999.000000,199999.000000,199999.000000,199999.000000,199999.000000
mean,2.771248e+07,11.359892,-72.527631,39.935881,-72.525292,39.923890,1.684543
std,1.601386e+07,9.901760,11.437815,7.720558,13.117408,6.794829,1.385995
min,1.000000e+00,-52.000000,-1340.648410,-74.015515,-3356.666300,-881.985513,0.000000
25%,1.382534e+07,6.000000,-73.992065,40.734796,-73.991407,40.733823,1.000000
50%,2.774524e+07,8.500000,-73.981823,40.752592,-73.980093,40.753042,1.000000
75%,4.155535e+07,12.500000,-73.967154,40.767158,-73.963659,40.768001,2.000000
max,5.542357e+07,499.000000,57.418457,1644.421482,1153.572603,872.697628,208.000000

## Calculate distance between each pickup and dropoff points using Haversine formula.

### Haversine Formula

In [9]:
R = 6378  #Radius of earth

def haversine_np(lon1, lat1, lon2, lat2):
    lon1, lat1, lon2, lat2 = map(np.radians, [lon1, lat1, lon2, lat2])

    dlon = lon2 - lon1
    dlat = lat2 - lat1

    a = np.sin(dlat/2.0)**2 + np.cos(lat1) * np.cos(lat2) * np.sin(dlon/2.0)**2
    c = 2 * np.arcsin(np.sqrt(a))
    km = R * c
    
    return km

In [10]:
df['haversine'] =  haversine_np(df['pickup_longitude'], df['pickup_latitude'], df['dropoff_longitude'], df['dropoff_latitude'])

In [11]:
x = df[df['haversine'] == 0]

# Calculate the mean 'fare_amount' for rides with 0 Haversine distance
mean = x['fare_amount'].mean()

In [12]:
mean

11.585317826704578

## What is the median haversine distance between pickup and dropoff location according to the given dataset?

In [ ]:
2.123323

## What is the maximum haversine distance between pickup and dropoff location according to the given dataset?

## What is the maximum 'fare_amount' for a ride?

In [13]:
df.describe()

,ride_id,fare_amount,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine
count,1.999990e+05,199999.000000,199999.000000,199999.000000,199999.000000,199999.000000,199999.000000,199999.000000
mean,2.771248e+07,11.359892,-72.527631,39.935881,-72.525292,39.923890,1.684543,20.878264
std,1.601386e+07,9.901760,11.437815,7.720558,13.117408,6.794829,1.385995,383.385416
min,1.000000e+00,-52.000000,-1340.648410,-74.015515,-3356.666300,-881.985513,0.000000,0.000000
25%,1.382534e+07,6.000000,-73.992065,40.734796,-73.991407,40.733823,1.000000,1.216557
50%,2.774524e+07,8.500000,-73.981823,40.752592,-73.980093,40.753042,1.000000,2.123323
75%,4.155535e+07,12.500000,-73.967154,40.767158,-73.963659,40.768001,2.000000,3.879427
max,5.542357e+07,499.000000,57.418457,1644.421482,1153.572603,872.697628,208.000000,16427.268436

In [14]:
max(df['haversine'])

16427.26843588563

In [15]:
df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine
0,24238194,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1,1.685172
1,27835199,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1,2.460290
2,44984355,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1,5.041911
3,25894730,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3,1.663509
4,17610152,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5,4.480367

## Which of the following is the correct syntax to convert 'pickup_datetime' to datetime datatype?

In [16]:
df['pickup_datetime'] = pd.to_datetime(df['pickup_datetime'])

In [17]:
df['year'] = df['pickup_datetime'].dt.year

In [18]:
df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine,year
0,24238194,7.5,2015-05-07 19:52:06+00:00,-73.999817,40.738354,-73.999512,40.723217,1,1.685172,2015
1,27835199,7.7,2009-07-17 20:04:56+00:00,-73.994355,40.728225,-73.994710,40.750325,1,2.460290,2009
2,44984355,12.9,2009-08-24 21:45:00+00:00,-74.005043,40.740770,-73.962565,40.772647,1,5.041911,2009
3,25894730,5.3,2009-06-26 08:22:21+00:00,-73.976124,40.790844,-73.965316,40.803349,3,1.663509,2009
4,17610152,16.0,2014-08-28 17:47:00+00:00,-73.925023,40.744085,-73.973082,40.761247,5,4.480367,2014

## How many rides were recorded in the year 2014?

In [19]:
df['year'].value_counts()

2012    32396
2011    31945
2013    31194
2009    30536
2010    30194
2014    29968
2015    13766
Name: year, dtype: int64

In [20]:
df['month'] = df['pickup_datetime'].dt.month

In [21]:
df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine,year,month
0,24238194,7.5,2015-05-07 19:52:06+00:00,-73.999817,40.738354,-73.999512,40.723217,1,1.685172,2015,5
1,27835199,7.7,2009-07-17 20:04:56+00:00,-73.994355,40.728225,-73.994710,40.750325,1,2.460290,2009,7
2,44984355,12.9,2009-08-24 21:45:00+00:00,-74.005043,40.740770,-73.962565,40.772647,1,5.041911,2009,8
3,25894730,5.3,2009-06-26 08:22:21+00:00,-73.976124,40.790844,-73.965316,40.803349,3,1.663509,2009,6
4,17610152,16.0,2014-08-28 17:47:00+00:00,-73.925023,40.744085,-73.973082,40.761247,5,4.480367,2014,8

In [22]:
df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine,year,month
0,24238194,7.5,2015-05-07 19:52:06+00:00,-73.999817,40.738354,-73.999512,40.723217,1,1.685172,2015,5
1,27835199,7.7,2009-07-17 20:04:56+00:00,-73.994355,40.728225,-73.994710,40.750325,1,2.460290,2009,7
2,44984355,12.9,2009-08-24 21:45:00+00:00,-74.005043,40.740770,-73.962565,40.772647,1,5.041911,2009,8
3,25894730,5.3,2009-06-26 08:22:21+00:00,-73.976124,40.790844,-73.965316,40.803349,3,1.663509,2009,6
4,17610152,16.0,2014-08-28 17:47:00+00:00,-73.925023,40.744085,-73.973082,40.761247,5,4.480367,2014,8

In [23]:
df['pickup_datetime'] = pd.to_datetime(df['pickup_datetime']).dt.date

df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine,year,month
0,24238194,7.5,2015-05-07,-73.999817,40.738354,-73.999512,40.723217,1,1.685172,2015,5
1,27835199,7.7,2009-07-17,-73.994355,40.728225,-73.994710,40.750325,1,2.460290,2009,7
2,44984355,12.9,2009-08-24,-74.005043,40.740770,-73.962565,40.772647,1,5.041911,2009,8
3,25894730,5.3,2009-06-26,-73.976124,40.790844,-73.965316,40.803349,3,1.663509,2009,6
4,17610152,16.0,2014-08-28,-73.925023,40.744085,-73.973082,40.761247,5,4.480367,2014,8

In [24]:
df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine,year,month
0,24238194,7.5,2015-05-07,-73.999817,40.738354,-73.999512,40.723217,1,1.685172,2015,5
1,27835199,7.7,2009-07-17,-73.994355,40.728225,-73.994710,40.750325,1,2.460290,2009,7
2,44984355,12.9,2009-08-24,-74.005043,40.740770,-73.962565,40.772647,1,5.041911,2009,8
3,25894730,5.3,2009-06-26,-73.976124,40.790844,-73.965316,40.803349,3,1.663509,2009,6
4,17610152,16.0,2014-08-28,-73.925023,40.744085,-73.973082,40.761247,5,4.480367,2014,8

## How many rides were recorded in the first quarter of 2014?

In [25]:
start_date = pd.Timestamp('2014-01-01')
end_date = pd.Timestamp('2014-03-31')

q1 = df[(df['pickup_datetime'] >= start_date) & (df['pickup_datetime'] <= end_date)]

numbers = len(q1)

C:\Users\Deshmukh\anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:73: FutureWarning: Comparison of Timestamp with datetime.date is deprecated in order to match the standard library behavior. In a future version these will be considered non-comparable. Use 'ts == pd.Timestamp(date)' or 'ts.date() == date' instead.
  result = libops.scalar_compare(x.ravel(), y, op)

In [26]:
numbers

7687

## On which day of the week in September 2010, maximum rides were recorded ?

In [27]:
df['pickup_datetime'] = pd.to_datetime(df['pickup_datetime'])

start_date = pd.Timestamp('2010-09-01')
end_date = pd.Timestamp('2010-09-30')
september_rides = df[(df['pickup_datetime'] >= start_date) & (df['pickup_datetime'] <= end_date)]

september_rides['day_of_week'] = september_rides['pickup_datetime'].dt.day_name()

max_day = september_rides['day_of_week'].value_counts().idxmax()
max_rides = september_rides['day_of_week'].value_counts().max()

print(f"On {max_day} of the week in September 2010 were the maximum rides recorded")

On Thursday of the week in September 2010 were the maximum rides recorded

C:\Users\Deshmukh\AppData\Local\Temp\ipykernel_6420\3095676915.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  september_rides['day_of_week'] = september_rides['pickup_datetime'].dt.day_name()

In [28]:
df['ride_week_day'] = df['pickup_datetime'].dt.day_name()

df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine,year,month,ride_week_day
0,24238194,7.5,2015-05-07,-73.999817,40.738354,-73.999512,40.723217,1,1.685172,2015,5,Thursday
1,27835199,7.7,2009-07-17,-73.994355,40.728225,-73.994710,40.750325,1,2.460290,2009,7,Friday
2,44984355,12.9,2009-08-24,-74.005043,40.740770,-73.962565,40.772647,1,5.041911,2009,8,Monday
3,25894730,5.3,2009-06-26,-73.976124,40.790844,-73.965316,40.803349,3,1.663509,2009,6,Friday
4,17610152,16.0,2014-08-28,-73.925023,40.744085,-73.973082,40.761247,5,4.480367,2014,8,Thursday

In [29]:
df.drop(['month'], axis=1, inplace=True)

df.head()

,ride_id,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,haversine,year,ride_week_day
0,24238194,7.5,2015-05-07,-73.999817,40.738354,-73.999512,40.723217,1,1.685172,2015,Thursday
1,27835199,7.7,2009-07-17,-73.994355,40.728225,-73.994710,40.750325,1,2.460290,2009,Friday
2,44984355,12.9,2009-08-24,-74.005043,40.740770,-73.962565,40.772647,1,5.041911,2009,Monday
3,25894730,5.3,2009-06-26,-73.976124,40.790844,-73.965316,40.803349,3,1.663509,2009,Friday
4,17610152,16.0,2014-08-28,-73.925023,40.744085,-73.973082,40.761247,5,4.480367,2014,Thursday

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 199999 entries, 0 to 199999
Data columns (total 11 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   ride_id            199999 non-null  int64
 1   fare_amount        199999 non-null  float64
 2   pickup_datetime    199999 non-null  datetime64[ns]
 3   pickup_longitude   199999 non-null  float64
 4   pickup_latitude    199999 non-null  float64
 5   dropoff_longitude  199999 non-null  float64
 6   dropoff_latitude   199999 non-null  float64
 7   passenger_count    199999 non-null  int64
 8   haversine          199999 non-null  float64
 9   year               199999 non-null  int64
 10  ride_week_day      199999 non-null  object
dtypes: datetime64[ns](1), float64(6), int64(3), object(1)
memory usage: 18.3+ MB

In [31]:
new_df = df[["passenger_count","haversine","ride_week_day", "fare_amount"]]

new_df.head()

   passenger_count  haversine ride_week_day  fare_amount
0                1   1.685172      Thursday          7.5
1                1   2.460290        Friday          7.7
2                1   5.041911        Monday         12.9
3                3   1.663509        Friday          5.3
4                5   4.480367      Thursday         16.0

In [32]:
y = new_df['fare_amount']

In [33]:
X = new_df.drop('fare_amount', axis = 'columns')

In [34]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, train_size = 0.7, random_state = 10)

In [35]:
print(X_train.shape, y_train.shape)
print(X_test.shape, y_test.shape)

(139999, 3) (139999,)
(60000, 3) (60000,)

In [36]:
X_train.dtypes

passenger_count      int64
haversine          float64
ride_week_day       object
dtype: object

In [37]:
X_train_cat = X_train.select_dtypes(include = ['object'])

X_train_cat.head()

       ride_week_day
155902      Thursday
173411        Friday
167678     Wednesday
21086       Thursday
82547       Thursday

In [38]:
X_train_num = X_train.select_dtypes(include = ['int64', 'float64'])

X_train_num.head()

        passenger_count  haversine
155902                2   3.450338
173411                2   0.720591
167678                1   0.712029
21086                 2   3.262670
82547                 1   0.334898

In [39]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

X_train_num_rescaled = pd.DataFrame(scaler.fit_transform(X_train_num), 
                                    columns = X_train_num.columns, 
                                    index = X_train_num.index)

X_train_num_rescaled.head()

        passenger_count  haversine
155902         0.220352  -0.045773
173411         0.220352  -0.052841
167678        -0.483998  -0.052863
21086          0.220352  -0.046259
82547         -0.483998  -0.053839

In [40]:
from sklearn.preprocessing import OrdinalEncoder

le = OrdinalEncoder()

X_train_cat_le = pd.DataFrame(le.fit_transform(X_train_cat), 
                                    columns = X_train_cat.columns, 
                                    index = X_train_cat.index)

X_train_cat_le.head()

        ride_week_day
155902            4.0
173411            0.0
167678            6.0
21086             4.0
82547             4.0

In [41]:
X_train_transformed = pd.concat([X_train_num_rescaled, X_train_cat_le], axis = 'columns')

X_train_transformed.head()

        passenger_count  haversine  ride_week_day
155902         0.220352  -0.045773            4.0
173411         0.220352  -0.052841            0.0
167678        -0.483998  -0.052863            6.0
21086          0.220352  -0.046259            4.0
82547         -0.483998  -0.053839            4.0

In [42]:
X_test.dtypes

passenger_count      int64
haversine          float64
ride_week_day       object
dtype: object

In [43]:
X_test_cat = X_test.select_dtypes(include = ['object'])

X_test_cat.head()

       ride_week_day
92591         Sunday
181208        Sunday
109741        Monday
131052      Thursday
21096         Monday

In [44]:
X_test_num = X_test.select_dtypes(include = ['int64', 'float64'])

X_test_num.head()

        passenger_count  haversine
92591                 4   4.257259
181208                1   1.744292
109741                5   1.227236
131052                2   3.794835
21096                 1   1.538491

In [45]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

X_test_num_rescaled = pd.DataFrame(scaler.fit_transform(X_test_num), 
                                    columns = X_test_num.columns, 
                                    index = X_test_num.index)

X_test_num_rescaled.head()

        passenger_count  haversine
92591          1.780588  -0.042571
181208        -0.520359  -0.049244
109741         2.547571  -0.050617
131052         0.246623  -0.043799
21096         -0.520359  -0.049790

In [46]:
from sklearn.preprocessing import OrdinalEncoder

le = OrdinalEncoder()

X_test_cat_le = pd.DataFrame(le.fit_transform(X_test_cat), 
                                    columns = X_test_cat.columns, 
                                    index = X_test_cat.index)

X_test_cat_le.head()

        ride_week_day
92591             3.0
181208            3.0
109741            1.0
131052            4.0
21096             1.0

In [47]:
X_test_transformed = pd.concat([X_test_num_rescaled, X_test_cat_le], axis = 'columns')

X_test_transformed.head()

        passenger_count  haversine  ride_week_day
92591          1.780588  -0.042571            3.0
181208        -0.520359  -0.049244            3.0
109741         2.547571  -0.050617            1.0
131052         0.246623  -0.043799            4.0
21096         -0.520359  -0.049790            1.0

## Which algorithm gives the least adjusted R square value?

### ANSWER - Linear Regression has less R square i.e 0.00072

## 1. Linear Regression

In [62]:
from sklearn.linear_model import LinearRegression

LinearRegression = LinearRegression()

LinearRegression.fit(X_train_transformed, y_train)

LinearRegression()

In [63]:
y_test_pred = LinearRegression.predict(X_test_transformed)

In [64]:
from sklearn import metrics
from sklearn.metrics import r2_score


print('Mean Absolute Error: ', metrics.mean_absolute_error(y_test, y_test_pred))

print('Mean Squared Error: ', metrics.mean_squared_error(y_test, y_test_pred))

print('Root Mean Squared Error: ', np.sqrt(metrics.mean_squared_error(y_test, y_test_pred)))

print('R Square: ', r2_score(y_test, y_test_pred))

Mean Absolute Error:  6.074451308438186
Mean Squared Error:  98.97534763891328
Root Mean Squared Error:  9.948635466178931
R Square:  0.0007244748453468786

## 2.KNN Regression

In [65]:
from sklearn.neighbors import KNeighborsRegressor

KNeighborsRegressor = KNeighborsRegressor()

KNeighborsRegressor.fit(X_train_transformed, y_train)

KNeighborsRegressor()

In [66]:
y_test_pred = KNeighborsRegressor.predict(X_test_transformed)

In [67]:
from sklearn import metrics
from sklearn.metrics import r2_score


print('Mean Absolute Error: ', metrics.mean_absolute_error(y_test, y_test_pred))

print('Mean Squared Error: ', metrics.mean_squared_error(y_test, y_test_pred))

print('Root Mean Squared Error: ', np.sqrt(metrics.mean_squared_error(y_test, y_test_pred)))

print('R Square: ', r2_score(y_test, y_test_pred))

Mean Absolute Error:  3.005124266666667
Mean Squared Error:  34.41847082653333
Root Mean Squared Error:  5.866725733024626
R Square:  0.6525040191252434

## 3. Decision Tree Regression

In [68]:
from sklearn.tree import DecisionTreeRegressor

DecisionTreeRegressor = DecisionTreeRegressor()

DecisionTreeRegressor.fit(X_train_transformed, y_train)

DecisionTreeRegressor()

In [69]:
y_test_pred = DecisionTreeRegressor.predict(X_test_transformed)

In [70]:
from sklearn import metrics
from sklearn.metrics import r2_score


print('Mean Absolute Error: ', metrics.mean_absolute_error(y_test, y_test_pred))

print('Mean Squared Error: ', metrics.mean_squared_error(y_test, y_test_pred))

print('Root Mean Squared Error: ', np.sqrt(metrics.mean_squared_error(y_test, y_test_pred)))

print('R Square: ', r2_score(y_test, y_test_pred))

Mean Absolute Error:  3.6529863333333332
Mean Squared Error:  49.45617743518519
Root Mean Squared Error:  7.032508616076143
R Square:  0.5006802314149568

## 4. Random Forest Regression

In [71]:
from sklearn.ensemble import RandomForestRegressor
 
RandomForestRegressor = RandomForestRegressor()

RandomForestRegressor.fit(X_train_transformed, y_train)

RandomForestRegressor()

In [72]:
y_test_pred = RandomForestRegressor.predict(X_test_transformed)

In [73]:
from sklearn import metrics
from sklearn.metrics import r2_score


print('Mean Absolute Error: ', metrics.mean_absolute_error(y_test, y_test_pred))

print('Mean Squared Error: ', metrics.mean_squared_error(y_test, y_test_pred))

print('Root Mean Squared Error: ', np.sqrt(metrics.mean_squared_error(y_test, y_test_pred)))

print('R Square: ', r2_score(y_test, y_test_pred))

Mean Absolute Error:  3.0977173058982683
Mean Squared Error:  36.03014817271215
Root Mean Squared Error:  6.002511821955218
R Square:  0.6362321922016518